Revit 2027 API
ParameterTypeId.GridEndSegmentPattern Property
 "End Segment Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GridEndSegmentPattern { get; }
Public Shared ReadOnly Property GridEndSegmentPattern As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GridEndSegmentPattern {
	ForgeTypeId^ get ();
}
static member GridEndSegmentPattern : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace